'''
Варіант 4
а) Дан файл f, компоненти якого є цілими числами. Записати в файл g всі подвоєні
компоненти файлу f.
б) Дан текстовий файл f. Записати в файл g компоненти файлу f в зворотному
порядку, без повторюваних компонентів.
Котулич К.А. група 122А
'''
f = open("f.txt", 'w') # відкриваєсмо файл(або якщо його не існує створюємо)
f.write('1,2,3,4') # заповнюємо
g = open("g.txt", "a") # створюємо новий файл
x = f.read() # читаємо дані з файлу
x = x.split() # переводимо їх в список
for i in x: # перебираємо елементи
    j = int(i)*2 # подвоюємо кожен
    g.write(str(j)+'') # додаємо в другий список
f.close() # закриваємо обидва файла
g.close()

f_1 = open('f_1.txt', 'r') # відкриваєсмо файл(або якщо його не існує створюємо)
f_1.write('Hello world') # заповнюємо
g_1 = open('g_1.txt', 'w') # створюємо новий файл
x = '' # створюємо змінну строкового типу
for i in f_1: # перебираємо кожен елемент початкового файлу
    x+=i # иі додаємо до створеної змінної
x = x[::-1] # розвертаємо строку
z = list(x.split()) # переводимо в список
y = list(set(z)) # забираємо повторювані елементи
f_1.close() # закриваємо початковий файл
g_1.write(str(y)) # додаємо список до другого файлу
g_1.close() # закриваємо другий файл